In [1]:
import pandas as pd

In [2]:
# initialize list for the dataframe
data = [['Adam','male','Ph.D','NY','M', 'PT'],['Dina','female','M.S','NY','D','PT'], 
        ['John','male','AS','MI','S','FT'],['Elton','male','HS','AL','M', 'Unemployed'],
        ['Gina','female','HS','AK','D', 'Intern'],['Sara', 'female','M.S','AZ','S','FT'], 
        ['Lana','female','AS', 'CA','M','Intern'],['Tim','male','Ph.D','AR','D', 'PT'],
        ['Suzan','female','M.S','AZ','S','FT'], ['Aj','male','AS','CA','M','FT'],
        ['Luke','male','HS','CA','D', 'Unemployed'],['Salma','female','HS','CA','S', 'Intern'],
        ['Abby', 'female','M.S','CA','M','PT'], ['Sandra','female','HS','CO','D', 'PT'],
        ['Zen','male','Ph.D','CO','S', 'PT'],['Emma','female','M.S','DC','M','FT'], 
        ['Owen','male','AS','DE','D','Unemployed'],['Levi','male','HS','CT','S','Unemployed'],
        ['Eva','female','HS','DC','M', 'PT'],['Sophia', 'female','M.S','DC','D','PT'], 
        ['Ella','female','HS','FL','S', 'Unemployed'],['Jacob','male','Ph.D','IL','M', 'FT'],
        ['Mia','female','M.S','FL','D','PT'], ['Ethan','male','AS','FL','S','PT'],
        ['Luke','male','HS','IL','M', 'Intern'],['Nadia','female','HS','IN','D', 'Intern'],
        ['Tulip', 'female','M.S','IA','S','PT'],['Linda','female','HS','KS','M', 'PT'],
        ['Jack','male','Ph.D','KI','D', 'PT'],['Kindra','female','M.S','LA','S','FT'],
        ['Manson','male','AS','ME','M','Unemployed'],['Logan','male','HS','MD','D', 'Unemployed'],
        ['Luna','female','HS','MA','S', 'Unemployed'],['Layla', 'female','M.S','MN','M','Unemployed'],
        ['Lynn','female','HS','MS','D', 'PT'],['Nora','male','Ph.D','MS','S', 'FT'],
        ['Suzy','female','M.S','MO','M','PT'], ['Lucas','male','AS','MT','D','PT'],
        ['Chad','male','HS','TX','S', 'Unemployed'], ['Soleen','female','HS','TX','M','Unemployed'],
        ['Zoey', 'female','M.S','NY','D','FT'], ['Ellie','female','HS','TX','S', 'Unemployed'],
        ['Oliver','male','Ph.D','TX','M','PT'],['Tamara','female','M.S','NJ','D','PT'], 
        ['Noah','male','AS','NJ','S','FT'], ['Liam','male','HS','MI','M', 'Unemployed'],
        ['Stella','female','HS','NM','D', 'Unemployed'],['Audrey', 'female','M.S','NC','S','PT'], 
        ['Lucy','female','HS','ND','M', 'PT'],['Timmy','male','Ph.D','OH','D', 'PT'],
        ['Bella','female','M.S','OH','S','PT'], ['William','male','AS','OK','M','FT'],
        ['Brian','male','HS','OK','D', 'Unemployed'],['Nova','female','HS','OR','S', 'Unemployed'],
        ['AnnaAbby', 'female','M.S','MI','M','FT'], ['Elena','female','HS','NY','D', 'Intern']]

In [3]:
# Create dataframe
df = pd.DataFrame(data, columns = ['Name', 'Gender','Education','State','Marital Status','Employment Status'])

In [4]:
df.shape

(56, 6)

In [5]:
df.head()

    Name  Gender Education State Marital Status Employment Status
0   Adam    male      Ph.D    NY              M                PT
1   Dina  female       M.S    NY              D                PT
2   John    male        AS    MI              S                FT
3  Elton    male        HS    AL              M        Unemployed
4   Gina  female        HS    AK              D            Intern

In [6]:
df1 = df.copy()

### Ordinal Encoder

In [7]:
df['Education'].unique()

array(['Ph.D', 'M.S', 'AS', 'HS'], dtype=object)

In [8]:
from sklearn.preprocessing import OrdinalEncoder
ordinal = OrdinalEncoder(categories=[['HS', 'AS', 'M.S','Ph.D']])  
df['Education'] = ordinal.fit_transform(df[['Education']])
df.head()

    Name  Gender  Education State Marital Status Employment Status
0   Adam    male        3.0    NY              M                PT
1   Dina  female        2.0    NY              D                PT
2   John    male        1.0    MI              S                FT
3  Elton    male        0.0    AL              M        Unemployed
4   Gina  female        0.0    AK              D            Intern

### One Hot Encoding

#### get_dummies

In [9]:
pd.get_dummies(df['Gender']).head()

   female  male
0       0     1
1       1     0
2       0     1
3       0     1
4       1     0

In [10]:
pd.get_dummies(df['Marital Status'],drop_first=False).head()

   D  M  S
0  0  1  0
1  1  0  0
2  0  0  1
3  0  1  0
4  1  0  0

In [11]:
df0 = df.copy()

#### One Hot Encoder from sklearn

In [12]:
from sklearn.preprocessing import OneHotEncoder
ohe = OneHotEncoder(sparse=False)
ohe.fit_transform(df0[['Marital Status']])

array([[0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.]])

### Label Encoding

In [13]:
from sklearn.preprocessing import LabelEncoder 
lbe = LabelEncoder()
df1['Employment Status']= lbe.fit_transform(df1['Employment Status']) 
df1.head()

    Name  Gender Education State Marital Status  Employment Status
0   Adam    male      Ph.D    NY              M                  2
1   Dina  female       M.S    NY              D                  2
2   John    male        AS    MI              S                  0
3  Elton    male        HS    AL              M                  3
4   Gina  female        HS    AK              D                  1